STMicroelectronics/OpenOCD/src/flash/nor/spc58x.h
typedef struct _c55_block_info
{
    UINT32 n16KBlockNum;         /* Number of 16K blocks */
    UINT32 n32KBlockNum;         /* Number of 32K blocks */
    UINT32 n64KBlockNum;         /* Number of 64K blocks */
    UINT32 n128KBlockNum;        /* Number of 128K blocks */

} BLOCK_INFO, *PBLOCK_INFO;


/* SSD Configuration Structure */
typedef struct _c55_ssd_config
{
    UINT32 c55RegBase;           /* C55 control register base */
    UINT32 mainArrayBase;        /* base of main array */
    BLOCK_INFO lowBlockInfo;     /* blocks info of low address space */
    BLOCK_INFO midBlockInfo;     /* blocks info of mid address space */
    BLOCK_INFO highBlockInfo;    /* blocks info of high address space */

	UINT32 nLargeBlockNum;        /* number of blocks in Large address space */

	UINT32 uTestArrayBase;       /* base of UTEST array */
    UINT8 mainInterfaceFlag;      /* interface flag indicate main or alternate interface */
    UINT32 programmableSize;     /* programmable size */
    UINT8 BDMEnable;              /* debug mode selection */
} SSD_CONFIG, *PSSD_CONFIG;


/* MISR structure */
typedef struct _c55_misr
{
    UINT32 W0;
    UINT32 W1;
    UINT32 W2;
    UINT32 W3;
    UINT32 W4;
    UINT32 W5;
    UINT32 W6;
    UINT32 W7;
    UINT32 W8;
    UINT32 W9;
} MISR, *PMISR;

/* Structure data for the context values */
typedef struct _c55_context_data
{
    UINT32 dest;
    UINT32 size;
    UINT32 source;
    UINT32 *pFailedAddress;
    UINT32 *pFailedData;
    UINT32 *pFailedSource;
    UINT32 *pSum;
    PMISR pMisr;
    void* pReqCompletionFn;
} CONTEXT_DATA, *PCONTEXT_DATA;

/* Block select structure for Large address space */
typedef struct _c55_nLarge_block_sel
{
    UINT32 firstLargeBlockSelect;
    UINT32 secondLargeBlockSelect;
} NLARGE_BLOCK_SEL, *PNLARGE_BLOCK_SEL;


typedef UINT32 (*PFLASHPROGRAM) ( PSSD_CONFIG pSSDConfig,
                    BOOL factoryPgmFlag,
                    UINT32 dest,
                    UINT32 size,
                    UINT32 source,
                    PCONTEXT_DATA pCtxData
                    );

#define C55_REG_BASE                    0xF7FE0000					

#define MAIN_ARRAY_BASE                 0x00404000


#define UTEST_ARRAY_BASE                0x00400000
#define UTEST_ARRAY_SIZE                0x00004000

#define C55_PROGRAMMABLE_SIZE           0x80

#define BUFFER_SIZE_BYTE                0x1000

/* Lock State */
#define LOCK_ALL_BLOCKS                 0xFFFFFFFF
#define UNLOCK_ALL_BLOCKS               0x00000000

/* FLASH sectorization */

// Low Flash Blocks

/* Low space block 0 */
#define FLS_OFFSET_LOW_16K_BLOCK0	0x00FC4000	/* Offset of low block 0 */
#define FLS_SIZE_LOW_16K_BLOCK0		0x4000		/* 16KB size */

/* Low space block 1 */
#define FLS_OFFSET_LOW_16K_BLOCK1	0x00FCC000	/* Offset of low block 1 */
#define FLS_SIZE_LOW_16K_BLOCK1		0x4000		/* 16KB size */		

/* Low space block 2 */
#define FLS_OFFSET_LOW_16K_BLOCK2	0x00FC0000	/* Offset of low block 2 */
#define FLS_SIZE_LOW_16K_BLOCK2		0x4000		/* 16KB size */		

/* Low space block 3 */
#define FLS_OFFSET_LOW_16K_BLOCK3	0x00FC8000	/* Offset of low block 3 */
#define FLS_SIZE_LOW_16K_BLOCK3		0x4000		/* 16KB size */		

/* Low space block 4 */
#define FLS_OFFSET_LOW_16K_BLOCK4	0x0060C000	/* Offset of low block 4 */
#define FLS_SIZE_LOW_16K_BLOCK4		0x4000		/* 16KB size */		

/* Low space block 5 */
#define FLS_OFFSET_LOW_32K_BLOCK5	0x00FD0000	/* Offset of low block 5 */
#define FLS_SIZE_LOW_32K_BLOCK5		0x8000		/* 32KB size */

/* Low space block 6 */
#define FLS_OFFSET_LOW_32K_BLOCK6	0x00FD8000	/* Offset of low block 6 */
#define FLS_SIZE_LOW_32K_BLOCK6		0x8000		/* 32KB size */

/* Low space block 7 */
#define FLS_OFFSET_LOW_64K_BLOCK7	0x00FE0000	/* Offset of low block 7 */
#define FLS_SIZE_LOW_64K_BLOCK7		0x10000		/* 64KB size */	

/* Low space block 8 */
#define FLS_OFFSET_LOW_64K_BLOCK8	0x00FF0000	/* Offset of low block 8 */
#define FLS_SIZE_LOW_64K_BLOCK8		0x10000		/* 64KB size */	

/* Low space block 9 */
#define FLS_OFFSET_LOW_64K_BLOCK9	0x00610000	/* Offset of low block 9 */
#define FLS_SIZE_LOW_64K_BLOCK9		0x10000		/* 64KB size */	

/* Low space block 10 */
#define FLS_OFFSET_LOW_64K_BLOCK10	0x00620000	/* Offset of low block 10 */
#define FLS_SIZE_LOW_64K_BLOCK10	0x10000		/* 64KB size */	





/* Large space block 0 */
#define FLS_OFFSET_256K_BLOCK0    0x01000000  /* Offset of Large block 0 */
#define FLS_SIZE_256K_BLOCK0      0x20000     /* 128KB size */

/* Large space block 1 */
#define FLS_OFFSET_256K_BLOCK1    0x010200000  /* Offset of Large block 1 */    
#define FLS_SIZE_256K_BLOCK1      0x20000     /* 128KB size */

/* Large space block 2 */
#define FLS_OFFSET_256K_BLOCK2    0x01040000  /* Offset of Large block 2 */
#define FLS_SIZE_256K_BLOCK2      0x40000     /* 256KB size */

/* Large space block 3 */
#define FLS_OFFSET_256K_BLOCK3    0x01080000  /* Offset of Large block 3 */
#define FLS_SIZE_256K_BLOCK3      0x40000     /* 256KB size */

/* Large space block 4 */
#define FLS_OFFSET_256K_BLOCK4    0x010C0000  /* Offset of Large block 4 */
#define FLS_SIZE_256K_BLOCK4      0x40000     /* 256KB size */

/* Large space block 5 */
#define FLS_OFFSET_256K_BLOCK5    0x01100000  /* Offset of Large block 5 */
#define FLS_SIZE_256K_BLOCK5      0x40000     /* 256KB size */

/* Large space block 6 */
#define FLS_OFFSET_256K_BLOCK6    0x01140000  /* Offset of Large block 6 */
#define FLS_SIZE_256K_BLOCK6      0x40000     /* 256KB size */

/* Large space block 7 */
#define FLS_OFFSET_256K_BLOCK7    0x01180000  /* Offset of Large block 7 */
#define FLS_SIZE_256K_BLOCK7      0x40000     /* 256KB size */

/* Large space block 8 */
#define FLS_OFFSET_256K_BLOCK8    0x011C0000  /* Offset of Large block 8 */
#define FLS_SIZE_256K_BLOCK8      0x40000     /* 256KB size */

/* Large space block 9 */
#define FLS_OFFSET_256K_BLOCK9    0x01200000  /* Offset of Large block 9 */
#define FLS_SIZE_256K_BLOCK9      0x40000     /* 256KB size */

/* Large space block 10 */
#define FLS_OFFSET_256K_BLOCK10    0x01240000  /* Offset of Large block 10 */
#define FLS_SIZE_256K_BLOCK10      0x40000     /* 256KB size */

/* Large space block 11 */
#define FLS_OFFSET_256K_BLOCK11    0x01280000  /* Offset of Large block 11 */
#define FLS_SIZE_256K_BLOCK11      0x40000     /* 256KB size */

