STMicroelectronics/OpenOCD/src/flash/nor/spc58x.h
/* Large space block 12 */
#define FLS_OFFSET_256K_BLOCK12    0x012C0000  /* Offset of Large block 12 */
#define FLS_SIZE_256K_BLOCK12      0x40000     /* 256KB size */

/* Large space block 13 */
#define FLS_OFFSET_256K_BLOCK13    0x01300000  /* Offset of Large block 13 */
#define FLS_SIZE_256K_BLOCK13      0x40000     /* 256KB size */

/* Large space block 14 */
#define FLS_OFFSET_256K_BLOCK14    0x01340000  /* Offset of Large block 14 */
#define FLS_SIZE_256K_BLOCK14      0x40000     /* 256KB size */

/* Large space block 15 */
#define FLS_OFFSET_256K_BLOCK15    0x01380000  /* Offset of Large block 15 */
#define FLS_SIZE_256K_BLOCK15      0x40000     /* 256KB size */

/* Large space block 16 */
#define FLS_OFFSET_256K_BLOCK16    0x013C0000  /* Offset of Large block 16 */
#define FLS_SIZE_256K_BLOCK16      0x40000     /* 256KB size */

/* Large space block 17 */
#define FLS_OFFSET_256K_BLOCK17    0x01400000  /* Offset of Large block 17 */
#define FLS_SIZE_256K_BLOCK17      0x40000     /* 256KB size */

/* Large space block 18 */
#define FLS_OFFSET_256K_BLOCK18    0x01440000  /* Offset of Large block 18 */
#define FLS_SIZE_256K_BLOCK18      0x40000     /* 256KB size */

/* Large space block 19 */
#define FLS_OFFSET_256K_BLOCK19    0x01480000  /* Offset of Large block 19 */
#define FLS_SIZE_256K_BLOCK19      0x40000     /* 256KB size */

/* Large space block 20 */
#define FLS_OFFSET_256K_BLOCK20    0x014CC000  /* Offset of Large block 20 */
#define FLS_SIZE_256K_BLOCK20      0x40000     /* 256KB size */

/* Large space block 21 */
#define FLS_OFFSET_256K_BLOCK21    0x01500000  /* Offset of Large block 21 */
#define FLS_SIZE_256K_BLOCK21      0x40000     /* 256KB size */

/* Large space block 22 */
#define FLS_OFFSET_256K_BLOCK22    0x01540000  /* Offset of Large block 22 */
#define FLS_SIZE_256K_BLOCK22      0x40000     /* 256KB size */

/* Large space block 23 */
#define FLS_OFFSET_256K_BLOCK23    0x01580000  /* Offset of Large block 23 */
#define FLS_SIZE_256K_BLOCK23      0x40000     /* 256KB size */

/* Large space block 24 */
#define FLS_OFFSET_256K_BLOCK24    0x015C0000  /* Offset of Large block 24 */
#define FLS_SIZE_256K_BLOCK24      0x40000     /* 256KB size */

/* Large space block 25 */
#define FLS_OFFSET_256K_BLOCK25    0x01600000  /* Offset of Large block 25 */
#define FLS_SIZE_256K_BLOCK25      0x40000     /* 256KB size */

/* Large space block 26 */
#define FLS_OFFSET_256K_BLOCK26    0x01640000  /* Offset of Large block 26 */
#define FLS_SIZE_256K_BLOCK26      0x40000     /* 256KB size */

/* Large space block 27 */
#define FLS_OFFSET_256K_BLOCK27    0x01680000  /* Offset of Large block 27 */
#define FLS_SIZE_256K_BLOCK27      0x40000     /* 256KB size */

/* Large space block 28 */
#define FLS_OFFSET_256K_BLOCK28    0x016C0000  /* Offset of Large block 28 */
#define FLS_SIZE_256K_BLOCK28      0x40000     /* 256KB size */

/* Large space block 29 */
#define FLS_OFFSET_256K_BLOCK29    0x01700000  /* Offset of Large block 29 */
#define FLS_SIZE_256K_BLOCK29      0x40000     /* 256KB size */

/* Large space block 30 */
#define FLS_OFFSET_256K_BLOCK30    0x01740000  /* Offset of Large block 30 */
#define FLS_SIZE_256K_BLOCK30      0x40000     /* 256KB size */

/* Large space block 31 */
#define FLS_OFFSET_256K_BLOCK31    0x01780000  /* Offset of Large block 31 */
#define FLS_SIZE_256K_BLOCK31      0x40000     /* 256KB size */

/* Large space block 32 */
#define FLS_OFFSET_256K_BLOCK32    0x017C0000  /* Offset of Large block 32 */
#define FLS_SIZE_256K_BLOCK32      0x40000     /* 256KB size */

/* Large space block 33 */
#define FLS_OFFSET_256K_BLOCK33    0x01800000  /* Offset of Large block 33 */
#define FLS_SIZE_256K_BLOCK33      0x40000     /* 256KB size */

/* Large space block 34 */
#define FLS_OFFSET_256K_BLOCK34    0x01840000  /* Offset of Large block 34 */
#define FLS_SIZE_256K_BLOCK34      0x40000     /* 256KB size */

/* Large space block 35 */
#define FLS_OFFSET_256K_BLOCK35    0x01880000  /* Offset of Large block 35 */
#define FLS_SIZE_256K_BLOCK35      0x40000     /* 256KB size */

/* Large space block 36 */
#define FLS_OFFSET_256K_BLOCK36    0x018C0000  /* Offset of Large block 36 */
#define FLS_SIZE_256K_BLOCK36      0x40000     /* 256KB size */

/* Large space block 37 */
#define FLS_OFFSET_256K_BLOCK37    0x01900000  /* Offset of Large block 37 */
#define FLS_SIZE_256K_BLOCK37      0x40000     /* 256KB size */

/* Large space block 38 */
#define FLS_OFFSET_256K_BLOCK38    0x01940000  /* Offset of Large block 38 */
#define FLS_SIZE_256K_BLOCK38      0x40000     /* 256KB size */

/* Large space block 39 */
#define FLS_OFFSET_256K_BLOCK39    0x01980000  /* Offset of Large block 39 */
#define FLS_SIZE_256K_BLOCK39      0x40000     /* 256KB size */




//Data Flash Blocks

/* High space block 0 */
#define FLS_OFFSET_HIGH_64K_BLOCK0     0x00800000  /* Offset of high block 0 */
#define FLS_SIZE_HIGH_64K_BLOCK0       0x10000     /* 64KB size */

/* High space block 1 */
#define FLS_OFFSET_HIGH_64K_BLOCK1     0x00810000  /* Offset of high block 1 */
#define FLS_SIZE_HIGH_64K_BLOCK1       0x10000     /* 64KB size */

/* High space block 2 */
#define FLS_OFFSET_HIGH_64K_BLOCK2     0x00820000  /* Offset of high block 2 */
#define FLS_SIZE_HIGH_64K_BLOCK2       0x10000     /* 64KB size */

/* High space block 3 */
#define FLS_OFFSET_HIGH_64K_BLOCK3     0x00830000  /* Offset of high block 3 */
#define FLS_SIZE_HIGH_64K_BLOCK3       0x10000     /* 64KB size */


/* Mid space block 0 */
#define FLS_OFFSET_MID_16K_BLOCK0     0x00680000  /* Offset of mid block 0 */
#define FLS_SIZE_MID_16K_BLOCK0       0x4000      /* 16KB size */

/* Mid space block 1 */
#define FLS_OFFSET_MID_16K_BLOCK1     0x00684000  /* Offset of mid block 0 */  
#define FLS_SIZE_MID_16K_BLOCK1       0x4000      /* 16KB size */

#define FLASH_ARRAY_SIZE	  0x200000 /* Flash total size */

#define MIS_ALIGNED_VALUE               0x07
#define FlashOutRangeValue              0x00500000

#define FAIL  0
#define PASS  (!FAIL)

// BOOL Test_Result = FAIL;

/* Prototype of error trap funciton */
// static void ErrorTrap(UINT32 returnCode);

/* Typedef for null callback */
typedef void (*tpfNullCallback)(void);
